sergev/pic32prog/target.c
    {0x720B053, "MZ0512EFE100",  512,   &family_mz},
    {0x7210053, "MZ0512EFF100",  512,   &family_mz},
    {0x7238053, "MZ0512EFK100",  512,   &family_mz},
    {0x720C053, "MZ1024EFE100", 1024,   &family_mz},
    {0x7211053, "MZ1024EFF100", 1024,   &family_mz},
    {0x7239053, "MZ1024EFK100", 1024,   &family_mz},
    {0x720D053, "MZ1024EFG100", 1024,   &family_mz},
    {0x7212053, "MZ1024EFH100", 1024,   &family_mz},
    {0x723A053, "MZ1024EFM100", 1024,   &family_mz},
    {0x720E053, "MZ2048EFG100", 2048,   &family_mz},
    {0x7213053, "MZ2048EFH100", 2048,   &family_mz},
    {0x723B053, "MZ2048EFM100", 2048,   &family_mz},

    {0x7215053, "MZ0512EFE124",  512,   &family_mz},
    {0x721A053, "MZ0512EFF124",  512,   &family_mz},
    {0x7242053, "MZ0512EFK124",  512,   &family_mz},
    {0x7216053, "MZ1024EFE124", 1024,   &family_mz},
    {0x721B053, "MZ1024EFF124", 1024,   &family_mz},
    {0x7243053, "MZ1024EFK124", 1024,   &family_mz},
    {0x7217053, "MZ1024EFG124", 1024,   &family_mz},
    {0x721C053, "MZ1024EFH124", 1024,   &family_mz},
    {0x7244053, "MZ1024EFM124", 1024,   &family_mz},
    {0x7218053, "MZ2048EFG124", 2048,   &family_mz},
    {0x721D053, "MZ2048EFH124", 2048,   &family_mz},
    {0x7245053, "MZ2048EFM124", 2048,   &family_mz},

    {0x721F053, "MZ0512EFE144",  512,   &family_mz},
    {0x7224053, "MZ0512EFF144",  512,   &family_mz},
    {0x724C053, "MZ0512EFK144",  512,   &family_mz},
    {0x7220053, "MZ1024EFE144", 1024,   &family_mz},
    {0x7225053, "MZ1024EFF144", 1024,   &family_mz},
    {0x724D053, "MZ1024EFK144", 1024,   &family_mz},
    {0x7221053, "MZ1024EFG144", 1024,   &family_mz},
    {0x7226053, "MZ1024EFH144", 1024,   &family_mz},
    {0x724E053, "MZ1024EFM144", 1024,   &family_mz},
    {0x7222053, "MZ2048EFG144", 2048,   &family_mz},
    {0x7227053, "MZ2048EFH144", 2048,   &family_mz},
    {0x724F053, "MZ2048EFM144", 2048,   &family_mz},

    /* MZ DA family */
    {0x5f4f053, "MZ2048XXXXXX", 2048,   &family_mz},
    {0x5fb7053, "MZ2048XXXXXX", 2048,   &family_mz},

    /* MM family */
    {0x46b12053, "MM0064GPL028",  64,   &family_mm},
    {0x46b16053, "MM0064GPL036",  64,   &family_mm},
    {0x66b04053, "MM0016GPL028",  16,   &family_mm},

    /* MK family */
    {0x6201053, "MK1024MCF100",  1024,   &family_mk},


    /* USB bootloader */
    {0xEAFB00B, "Bootloader",   0,      &family_bl},
    {0}
};

/*
 * Table of supported serial protocols.
 */
static const struct {
    const char *prefix;
    adapter_t *(*func)(const char *port, int baud);
} serial_tab[] = {
    { "stk500",     adapter_open_stk500v2       },  /* Default */
    { "an1388",     adapter_open_an1388_uart    },
    { "ascii",      adapter_open_bitbang        },
    { 0 },
};

/*
 * Table of supported USB protocols.
 */
static const struct {
    const char *prefix;
    adapter_t *(*func)(int vid, int pid, const char *serial);
} usb_tab[] = {
    { "pickit2",    adapter_open_pickit2        },
    { "pickit3",    adapter_open_pickit3        },
    { "hidboot",    adapter_open_hidboot        },
    { "an1388",     adapter_open_an1388         },
    { "uhb",        adapter_open_uhb            },
    { 0 },
};

#if defined(__CYGWIN32__) || defined(MINGW32)
/*
 * Delay in milliseconds: Windows.
 */
#include <windows.h>

void mdelay(unsigned msec)
{
    Sleep(msec);
}

int __ms_vsnprintf(char *str, size_t size, const char *format, va_list ap)
{
    // Needed to link the libusb-win32/libusb-1.0.a library.
    return 0;
}
#else
/*
 * Delay in milliseconds: Unix.
 */
void mdelay(unsigned msec)
{
    usleep(msec * 1000);
}
#endif

/*
 * Open USB adapter, detected by vendor/product ID.
 * Return a pointer to adapter structure, or 0 when not found.
 */
static adapter_t *open_usb_adapter(const char *port_name, int interface, int speed)
{
    char *delimiter;
    const char *serial = 0;
    int prefix_len, i, vid, pid;

    if (!port_name) {
        /* Autodetect the device from a list of known adapters. */
        adapter_t *a = adapter_open_pickit2(0, 0, 0);
		if(a && (INTERFACE_JTAG == interface)){
			fprintf(stderr, "Found Pickit2, but it does not support the JTAG interface\n");
			return 0;
		}
        if (! a){
            a = adapter_open_pickit3(0, 0, 0);
			if(a && (INTERFACE_JTAG == interface)){
				fprintf(stderr, "Found Pickit3, but it does not support the JTAG interface\n");
				return 0;
			}
		}
#ifdef USE_MPSSE
        if (! a)
            a = adapter_open_mpsse(0, 0, 0, interface, speed);
#endif
        if (! a){
            a = adapter_open_hidboot(0, 0, 0);
			if(a && (INTERFACE_DEFAULT != interface)){
				fprintf(stderr, "Found bootloader, ignoring specified interface\n");
			}
		}
        if (! a){
            a = adapter_open_an1388(0, 0, 0);
			if(a && (INTERFACE_DEFAULT != interface)){
				fprintf(stderr, "Found bootloader, ignoring specified interface\n");
			}
		}
        if (! a){
            a = adapter_open_uhb(0, 0, 0);
			if(a && (INTERFACE_DEFAULT != interface)){
				fprintf(stderr, "Found bootloader, ignoring specified interface\n");
			}
		}
        return a;
    }

    /* Get protocol prefix. */
    delimiter = strchr(port_name, ':');
    if (! delimiter)
        return 0;
    prefix_len = delimiter - port_name;

    /* Find prefix in the protocol table. */
    for (i=0; usb_tab[i].prefix; i++) {
        int len = strlen(usb_tab[i].prefix);
        if (prefix_len == len &&
            strncasecmp(port_name, usb_tab[i].prefix, len) == 0) {
            goto found;
        }
    }
    fprintf(stderr, "%s: Unknown USB protocol\n", port_name);
    return 0;

found:
    vid = strtoul(delimiter+1, &delimiter, 16);
    if (*delimiter != ':') {
        fprintf(stderr, "%s: Incorrect VID:PID value\n", port_name);
        return 0;
    }
    pid = strtoul(delimiter+1, &delimiter, 16);
    if (*delimiter == ':')
        serial = delimiter+1;

    return usb_tab[i].func(vid, pid, serial);
}

/*
 * Open serial adapter.
 * Use Arduino-compatible protocol (stk500v2) by default.
 * To select other protocols, add a prefix to the port name,
 * like "bitbang:COM5".
 */
static adapter_t *open_serial_adapter(const char *port_name, int baud_rate, 
										int interface, int speed)
{
    const char *prefix, *delimiter;
    int prefix_len, len, i;

	if (INTERFACE_DEFAULT != interface){
		fprintf(stderr, "Non-default interface currently not-supported on \
						serial adapters, ingoring specified interface\n");
	}

