sergev/pic32prog/target.c
    }
    else{
        /* MX, MZ */
        unsigned devcfg_addr = 0x1fc00000 + target_devcfg_offset(t);
        unsigned devcfg3 = t->adapter->read_word(t->adapter, devcfg_addr);
        unsigned devcfg2 = t->adapter->read_word(t->adapter, devcfg_addr + 4);
        unsigned devcfg1 = t->adapter->read_word(t->adapter, devcfg_addr + 8);
        unsigned devcfg0 = t->adapter->read_word(t->adapter, devcfg_addr + 12);

        if (devcfg3 == 0xffffffff && devcfg2 == 0xffffffff &&
            devcfg1 == 0xffffffff && devcfg0 == 0x7fffffff)
            return;
        if (devcfg3 == 0 && devcfg2 == 0 && devcfg1 == 0 && devcfg0 == 0)
            return;

        printf(_("Configuration:\n"));
        t->family->print_devcfg(devcfg0, devcfg1, devcfg2, devcfg3,
                                0, 0, 0, 0, 0, 0, 0, 0);
    }
}

/*
 * Translate virtual to physical address.
 */
static unsigned virt_to_phys(unsigned addr)
{
    if (addr >= 0x80000000 && addr < 0xA0000000)
        return addr - 0x80000000;
    if (addr >= 0xA0000000 && addr < 0xC0000000)
        return addr - 0xA0000000;
    return addr;
}

/*
 * Read data from memory.
 */
void target_read_block(target_t *t, unsigned addr,
    unsigned nwords, unsigned *data)
{
    if (! t->adapter->read_data) {
        printf(_("\nData reading not supported by the adapter.\n"));
        exit(1);
    }

    addr = virt_to_phys(addr);
    //fprintf(stderr, "target_read_block(addr = %x, nwords = %d)\n", addr, nwords);
    while (nwords > 0) {
        unsigned n = nwords;
        if (n > 256)
            n = 256;
        t->adapter->read_data(t->adapter, addr, n, data);
        addr += n<<2;
        data += n;
        nwords -= n;
    }
    //fprintf(stderr, "    done (addr = %x)\n", addr);
}

/*
 * Verify data.
 */
void target_verify_block(target_t *t, unsigned addr,
    unsigned nwords, unsigned *data)
{
    unsigned i, word, expected, block[512];

    //fprintf(stderr, "%s: addr=%08x, nwords=%u, data=%08x...\n", __func__, addr, nwords, data[0]);
    if (t->adapter->verify_data != 0) {
        t->adapter->verify_data(t->adapter, virt_to_phys(addr), nwords, data);
        return;
    }

    t->adapter->read_data(t->adapter, addr, nwords, block);
    for (i=0; i<nwords; i++) {
        expected = data [i];
        word = block [i];
        if (word != expected) {
            printf(_("\nerror at address %08X: file=%08X, mem=%08X\n"),
                addr + i*4, expected, word);
            exit(1);
        }
    }
}

/*
 * Erase all Flash memory.
 */
int target_erase(target_t *t)
{
    if (t->adapter->erase_chip) {
        printf(_("        Erase: "));
        fflush(stdout);
        t->adapter->erase_chip(t->adapter);
        printf(_("done\n"));
    }
    return 1;
}

/*
 * Test block for non 0xFFFFFFFF value
 */
static int target_test_empty_block(unsigned *data, unsigned nwords)
{
    while (nwords--)
        if (*data++ != 0xFFFFFFFF)
            return 0;
    return 1;
}

/*
 * Write to flash memory.
 */
void target_program_block(target_t *t, unsigned addr,
    unsigned nwords, unsigned *data)
{
    addr = virt_to_phys(addr);
    //fprintf(stderr, "target_program_block(addr = %x, nwords = %d)\n", addr, nwords);

    if (! t->adapter->program_block) {
        unsigned words_per_row = t->family->bytes_per_row / 4;
        while (nwords > 0) {
            unsigned n = nwords;
            if (n > words_per_row)
                n = words_per_row;
            if (! target_test_empty_block(data, words_per_row))
                t->adapter->program_row(t->adapter, addr, data, words_per_row);
            addr += n<<2;
            data += n;
            nwords -= n;
        }
    }
    while (nwords > 0) {
        unsigned n = nwords;
        if (n > 256)
            n = 256;
        t->adapter->program_block(t->adapter, addr, data);
        addr += n<<2;
        data += n;
        nwords -= n;
    }
}

/*
 * Program the configuration registers.
 */
void target_program_devcfg(target_t *t, uint32_t arg0, uint32_t arg1,
        uint32_t arg2, uint32_t arg3, uint32_t arg4, uint32_t arg5, 
        uint32_t arg6, uint32_t arg7, uint32_t arg8, uint32_t arg9, 
        uint32_t arg10, uint32_t arg11)
{
    if (! t->family->devcfg_offset)
        return;

    unsigned devcfg_addr = 0x1fc00000 + t->family->devcfg_offset;

    if (FAMILY_MM == t->family->name_short){
        uint32_t offset_first = 0xc0;
        uint32_t offset_alternate = 0x40;

        fprintf(stderr, "%s: fdevopt = %08x, ficd = %08x, fpor =  %08x,\n", __func__, arg0, arg1, arg2);
        fprintf(stderr, "fwdt = %08x, foscsel = %08x, fsecr =  %08x,\n", arg3, arg4, arg5);
        fprintf(stderr, "afdevopt = %08x, aficd = %08x, afpor =  %08x,\n", arg6, arg7, arg8);
        fprintf(stderr, "afwdt = %08x, afoscsel = %08x, afsecr =  %08x\n", arg9, arg10, arg11);

        // So, MM family doesn't have program_word, just double_word
        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_first + 0x00, 0xFFFFFFFF, arg0);   // padding + fdevopt
        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_first + 0x08, arg1, arg2);         // ficd + fpor
        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_first + 0x10, arg3, arg4);         // fwdt + foscsel
        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_first + 0x18, arg5, 0xFFFFFFFF);  // fsec + padding
        // Also says something about FSIGN, that doesn't appear anywhere else...

        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_alternate + 0x00, 0xFFFFFFFF, arg6);   // padding + afdevopt
        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_alternate + 0x08, arg7, arg8);         // aficd + afpor
        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_alternate + 0x10, arg9, arg10);        // afwdt + afoscsel
        t->adapter->program_double_word(t->adapter, devcfg_addr + offset_alternate + 0x18, arg11, 0xFFFFFFFF); // afsec + padding
        // Also says something about FSIGN, that doesn't appear anywhere else...

    }
    else{

        fprintf(stderr, "%s: devcfg0-3 = %08x %08x %08x %08x\n", __func__, arg0, arg1, arg2, arg3);
        if (t->family->pe_version >= 0x0500) {
            /* Since pic32mz, the programming executive */

            t->adapter->program_quad_word(t->adapter, devcfg_addr, arg3,
                arg2, arg1, arg0);
            return;
        }

        t->adapter->program_word(t->adapter, devcfg_addr, arg3);
        t->adapter->program_word(t->adapter, devcfg_addr + 4, arg2);
        t->adapter->program_word(t->adapter, devcfg_addr + 8, arg1);
        t->adapter->program_word(t->adapter, devcfg_addr + 12, arg0);

    }
}
